// memories.js
const memories = [
    {
        year: 2002,
        month: 11,
        day: 14,
        content: "大蜀黍破壳日"
    },
    {
        year: 2002,
        month: 12,
        day: 7,
        content: "小朋友破壳日"
    },
    {
        "year": 2015,
        "month": 9,
        "day": null,
        "content": "任何为人称道的美丽，不及第一次遇见你"
    },
    {
        "year": 2016,
        "month": 1,
        "day": null,
        "content": "这段时间我脸上痘痘好严重，我其实内心十分难受，但我又羞于启齿"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "？好像你也喜欢我，不然为什么你愿意每天和我聊天聊到凌晨两三点"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我想你绝对喜欢我，不然为什么在我面前这么害羞，还总陪我玩游戏"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我确定了，你真的也喜欢我，但是还不完全确定，再看看"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "寒假我们居然每天都能聊到深夜凌晨，我们到底在聊什么？"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "经过我十分详细的验证和试探，我确定我们非常相爱，我打算策划一下表白场景，我想电视剧里都用的套路我不能再用，别人说过的那些话我不能再说"
    },
    {
        "year": 2016,
        "month": 12,
        "day": null,
        "content": "12月7号是你生日，生日前的周末我们一起吃了个饭然后去操场散了散步"
    },
    {
        "year": 2016,
        "month": 12,
        "day": null,
        "content": "我应该怎么自然引出要表白这个话题呢？我想了一段时间，我找到了一个稍微自然的话题"
    },
    {
        "year": 2016,
        "month": 12,
        "day": 24,
        "content": "我成功了！"
    },
    {
        "year": 2017,
        "month": null,
        "day": null,
        "content": "我非常开心，好像每天都特别兴奋"
    },
    {
        "year": 2017,
        "month": 12,
        "day": null,
        "content": "好像要中考了，我要在你面前表现一下，你看我只是稍微学了学，我就一下子考到了年级第14"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "我们真是天作之合，才子配佳人啊，你看我再稍微学了学我就考到了年级第二，全县第8"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "我每天学得特别痛苦，但我想到这一切都是为了两个人的未来，我觉得非常有动力"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "有天班主任叫我去办公室，她说你只是一时喜欢我而不会永远喜欢我，我回去思考了一段时间这句话"
    },
    {
        "year": 2018,
        "month": 6,
        "day": null,
        "content": "我觉得你这么漂亮，追求者这么多，你不可能永远陪着我，你实在是太漂亮了，我想我没什么东西可以支撑你的美丽"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "中考成绩出来了，我数学只考了95分，知道成绩后我哭了出来我觉得自己很失败"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "我无法想象分隔两地的日子，我不知道怎么办，我不知道怎么说，在北京的那一周我每天非常煎熬"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "我在北京，我没智能手机所以我们断联了一个多星期，回到家后，不知道为什么，我发自内心觉得如果我们分开两地，最终的结局一定就是你会离我而去，我从来没有不爱你，但那时候的我非常懦弱，没有担当，我不敢去爱你，也并没有从你的角度去思考问题，非常自私地选择断联。你可能从未想过我内心对这段感情有多么焦虑，我不敢告诉父母和老师，我也不知道该怎么处理。做出那种选择地我，非常懦弱和失败"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "看到你终于提出分手，我决定评估一下，我以前没想过，但最近我总有一个声音说“她肯定会和别人走的，那时候你就什么都没了”"
    },
    {
        "year": 2018,
        "month": 8,
        "day": null,
        "content": "我也觉得我们应该分手，我想你离开我后应该很快就会走出来，而我也是，所以这大概率是可以接受的"
    },
    {
        "year": 2018,
        "month": 9,
        "day": null,
        "content": "我去到一个离家很远的地方读书，我很痛苦，这种感觉令人难受"
    },
    {
        "year": 2018,
        "month": 11,
        "day": null,
        "content": "我很难过，我是觉得你不会一直选择我，但我发掘我依然爱你，我应该重新联系你"
    },
    {
        "year": 2019,
        "month": 1,
        "day": null,
        "content": "太好了，我们又在一起了，这次我一定会坚定维护我们这段感情"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "不明白为什么，虽然你答应和我重新在一起，但我的痛苦似乎没有减轻，我更加怀疑自己，更加自卑和自责"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "我很害怕，我觉得我非常糟糕，也许你离开我有更广阔的天地，我痘痘似乎也越来越多了，我很痛苦"
    },
    {
        "year": 2019,
        "month": 4,
        "day": null,
        "content": "这个月真的很忙，你认为我又不在乎你而提出分手，其实我知道你可能只是随便说说，但我有些想同意"
    },
    {
        "year": 2019,
        "month": null,
        "day": null,
        "content": "好吧，我认为这次分手你应该是经过了慎重考虑的，也许我们真的不合适，我最近很痛苦，即使和你重新在一起我依然有种痛苦感"
    },
    {
        "year": 2019,
        "month": 6,
        "day": null,
        "content": "为什么你会觉得我分手后会打你，这让我很难过，我感到羞耻，我看上去可能真的很糟糕"
    },
    {
        "year": 2020,
        "month": 1,
        "day": null,
        "content": "困在家里我很想联系你，但我还是忍住了，我想着寒假去看医生，结果来了疫情"
    },
    {
        "year": 2020,
        "month": 5,
        "day": null,
        "content": "我终于有勇气去找你，找完以后我也终于明白也许还是永不打扰好一些"
    },
    {
        "year": 2020,
        "month": 6,
        "day": null,
        "content": "我认为证明我喜欢的从来不是你的漂亮的唯一方式就是永远不打扰，当然如今这更多表明我爱的只是一个概念"
    },
    {
        "year": 2020,
        "month": 12,
        "day": null,
        "content": "时间真快，好像快高考了，但我一点儿也学不进去，我不想上学"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "我不想上学，我坐不下来安静不了，还有个同学偶尔会欺负我，我很痛苦，我非常想念你"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "无声的思念让我痛苦，复杂的孤独令我悲伤，永不打扰是我的底线，不过还好我可以偷偷想你"
    },
    {
        "year": 2021,
        "month": 7,
        "day": null,
        "content": "我去佛山复读了，我感觉自己实在是太糟糕了，为什么我失去了爱情，学业也如此糟糕"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "我去佛山读的那一年，这个月我回肇庆考试的时候看到你也在复读，我想打电话问问，结果是在拨通前那一刻我删除了联系人信息"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "要不要加微信问一句呢？算了还是别，我无法想象那种尴尬的感觉"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "这个复读成绩在我意料之外，我只考了570分，而我的数学居然只有72分，我想正常情况我应该是620分的"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "我只能上一个很普通的学校，这让我感到自己很失败，得知你上了本科我为你感到开心因为你取得了进步"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "看到你似乎有了新男友，你们看上去非常恩爱，我很开心，只是当我第一次知道的时候，会有点吃醋的感觉"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "人们说我想你是因为我找不到新的女朋友，这是有点道理的，但应该不是原因而是状态，况且这是循环论证，逻辑不太成立"
    },
    {
        "year": 2022,
        "month": 12,
        "day": null,
        "content": "你读过《窄门》吗，我想也许我喜欢的从来都只是一个概念而非具体的人"
    },
    {
        "year": 2024,
        "month": 11,
        "day": 14,
        "content": "祝你早安，午安，晚安，我今天22岁了，没能和你结婚将会是我一生的遗憾。"
    },

    // 2024-12-11 add :
    {
        "year": 2020,
        "month": 1,
        "day": null,
        "content": "我每天都学不下去，被关家里，我整天郁闷到了极点，我想着要不联系一下你，但我觉得这样很不尊重，你肯定会觉得我是因为无聊所以才去骚扰你，虽然可能不少原因是因为这个。"
    },
    {
        "year": 2020,
        "month": 6,
        "day": null,
        "content": "从前我学习是为了在你面前证明自己，我想请求要不一起努力学习，于是我联系了你，我以为这样以后我就可以找到学习的目标，不过结果让我很尴尬，我突然意识到，过去我打算让痘痘好点再去找你而等待的时间，其实已经冲淡了很多东西，只是我忽略了这部分变化，我非常难受，但是我想这也许就是懦弱的下场。怯懦自卑，就必定失去所爱之人。"
    },
    {
        "year": 2020,
        "month": 12,
        "day": null,
        "content": "18 岁生日快乐！ 以前我答应过要在你十八岁的生日送你一盒口红，但现在我不知道用什么借口，我又想起上次的尴尬场面，我觉得自己很失败。"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "我不想学了，我学不进去，我讨厌学习，也许我们还在一个学校就好了，我经常这样想。"
    },
    {
        "year": 2024,
        "month": 2,
        "day": null,
        "content": "我寻求基督教和哲学在一些方面的救赎，我阅读了一点圣经，再读了点西方哲学和物理，我笃信这世界上一定有一个上帝，这个上帝是一切的缔造者，人类无法想象。从维特根斯坦那里，我感到人类精神上的一切痛苦，可能都来自于人类自身语言逻辑的混乱和循环；从杜威那里，我认可有用就是好的这个观点，接受实验主义的观点。"
    },
    {
        "year": 2024,
        "month": 12,
        "day": 7,
        "content": "二十二岁生日快乐！即使生生不见，也要岁岁平安(≧∇≦)/🎂！我好像开始爱上一个新的女生，这是第二次有一个人出现在我的世界里，让我想去守护一辈子。虽然我想她一定不会答应和我结婚，但我还是为我爱上其他人而开心，因为我终于开始慢慢放下过去。以前我一直认为我这辈子不可能爱上第二个人，即使知晓你有新男友，我还是偷偷爱着你，但最近不一样了，这是一种没有过的感觉，我依然十分自闭，我还是为自己的痘痘和学业感到痛苦和挫败，但至少已经减去最让我感到自责和痛苦的一个。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 13,
        "content": "下午是足球比赛，我在比赛结束前进了一个球，终于看到你开心地笑了出来。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 14,
        "content": "我在日记写到，我要在桃花源盖房子。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 29,
        "content": "我写了一个非常无聊非常没有水平的非常简短的小说，今天拿给你看，你帮我修改了几个错别字，我收到后在文章后面把每个错别字分别抄写了一行。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 31,
        "content": "最近我们发生了点小矛盾，我已经忘了，但那时候我从不觉得有什么东西是可以将我们分开的。"
    },
    {
        "year": 2017,
        "month": 4,
        "day": 4,
        "content": "我写到，在聊天中说你已经完全是我的人了，我高兴得从椅子上跳了起来。"
    },
    {
        "year": 2017,
        "month": 4,
        "day": 5,
        "content": "似乎小矛盾得到了缓和。"
    },
    {
        "year": 2017,
        "month": 5,
        "day": 24,
        "content": "我写到，第五个月过去了。"
    },
    {
        "year": 2017,
        "month": 6,
        "day": 24,
        "content": "我写到，第六个月过去了。"
    },
    {
        "year": 2017,
        "month": 11,
        "day": 24,
        "content": "我写到，11 个月过去了，还有一个月就是我们恋爱一周年纪念日了，one month, excited? happy? 时间飞快，你我如初。"
    },
    {
        "year": 2018,
        "month": 2,
        "day": 21,
        "content": "我写到，400 多天过去了。"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 16,
        "content": "我写了很长一篇日记，结尾是‘我希望有一天，我们光明正大地，快乐地品味如茶一般的人生……’"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 17,
        "content": "我写了个中考最差目标，最后差了 14 分。"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 18,
        "content": "空"
    },
    {
        "year": 2020,
        "month": 12,
        "day": 24,
        "content": "我写了一首古体诗。"
    },
    {
        "year": 2020,
        "month": 12,
        "day": 24,
        "content": "我在贴纸栏许愿，我想未来有一天，你能回到我身边，如果回不来，那就祝你早安，午安，晚安。"
    }

    // 如果需要添加更多回忆，请按相同格式在此处添加对象
];
