// memories.js
const memories = [
    {
        "year": 2015,
        "month": 9,
        "day": null,
        "content": "第一次看到你我觉得这个女生好漂亮，难道这是喜欢的感觉吗？"
    },
    {
        "year": 2016,
        "month": 1,
        "day": null,
        "content": "这段时间我脸上痘痘好严重，我很抑郁，我害怕见人"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "某天我非常想死，我觉得我应该离开这个世界，但是后面我停下来了"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "啊？好像你也喜欢我，不然为什么你愿意每天和我聊天聊到凌晨两三点"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我想你绝对喜欢我，不然为什么在我面前这么害羞，还总陪我玩游戏"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我确定了，你真的也喜欢我，但是还不完全确定，再看看"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "寒假我们居然每天都能聊到深夜凌晨，我们到底在聊什么？"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我应该策划一下表白场景，电视剧里都用的套路我不能再用，别人说过的那些话我不能再说"
    },
    {
        "year": 2016,
        "month": 12,
        "day": null,
        "content": "12月7号是你生日，生日前的周末我们一起吃了个饭然后去操场散了散步"
    },
    {
        "year": 2016,
        "month": 12,
        "day": null,
        "content": "我应该怎么自然引出要表白这个话题呢？我想了一段时间，我找到了一个稍微自然的话题"
    },
    {
        "year": 2016,
        "month": 12,
        "day": 24,
        "content": "我成功了！"
    },
    {
        "year": 2017,
        "month": null,
        "day": null,
        "content": "我非常开心，好像每天都特别兴奋"
    },
    {
        "year": 2017,
        "month": 12,
        "day": null,
        "content": "好像要中考了，我要在你面前表现一下，你看我只是稍微学了学，我就一下子考到了年级第14"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "我们真是天作之合，才子配佳人啊，你看我再稍微学了学我就考到了年级第二，全县第8"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "我每天学得特别痛苦，但我想到这一切都是为了两个人的未来，我觉得非常有动力"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "有天班主任叫我去办公室，她说你只是一时喜欢我而不会永远喜欢我，我回去思考了一段时间这句话"
    },
    {
        "year": 2018,
        "month": 6,
        "day": null,
        "content": "我觉得你这么漂亮，追求者这么多，你不可能永远陪着我，你实在是太漂亮了，我想我没什么东西可以支撑你的美丽"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "中考成绩出来了，我数学只考了95分，知道成绩后我哭了出来我觉得自己很失败"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "我无法想象分隔两地的日子，我不知道怎么办，我不知道怎么说，在北京的那一周我每天非常煎熬"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "其实我虽然有点动摇觉得自己不配，但我还爱你，这两星期是我在北京，我没智能手机所以我们断联了"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "看到你终于提出分手，我决定评估一下，我以前没想过，但最近我总有一个声音说“她肯定会和别人走的，那时候你就什么都没了”"
    },
    {
        "year": 2018,
        "month": 8,
        "day": null,
        "content": "我也觉得我们应该分手，我想你离开我后应该很快就会走出来，而我也是，所以这大概率是可以接受的"
    },
    {
        "year": 2018,
        "month": 9,
        "day": null,
        "content": "我去到一个离家很远的地方读书，我很痛苦，这种感觉令人难受"
    },
    {
        "year": 2018,
        "month": 11,
        "day": null,
        "content": "我很难过，我是觉得你不会一直选择我，但我发掘我依然爱你，我应该重新联系你"
    },
    {
        "year": 2019,
        "month": 1,
        "day": null,
        "content": "太好了，我们又在一起了，这次我一定会坚定维护我们这段感情"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "不明白为什么，虽然你答应和我重新在一起，但我的痛苦似乎没有减轻，我更加怀疑自己，更加自卑和自责"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "我很害怕，我觉得我非常糟糕，也许你离开我有更广阔的天地，我痘痘似乎也越来越多了，我很痛苦"
    },
    {
        "year": 2019,
        "month": 4,
        "day": null,
        "content": "这个月真的很忙，你认为我又不在乎你而提出分手，其实我知道你可能只是随便说说，但我有些想同意"
    },
    {
        "year": 2019,
        "month": null,
        "day": null,
        "content": "好吧，我认为这次分手你应该是经过了慎重考虑的，也许我们真的不合适，我最近很痛苦，即使和你重新在一起我依然有种痛苦感"
    },
    {
        "year": 2019,
        "month": 6,
        "day": null,
        "content": "为什么你会觉得我分手后会打你，这让我很难过，我感到羞耻，我看上去可能真的很糟糕"
    },
    {
        "year": 2020,
        "month": 1,
        "day": null,
        "content": "困在家里我很想联系你，但我还是忍住了，我想着寒假去看医生，结果来了疫情"
    },
    {
        "year": 2020,
        "month": 5,
        "day": null,
        "content": "我终于有勇气去找你，找完以后我也终于明白也许还是永不打扰好一些"
    },
    {
        "year": 2020,
        "month": 6,
        "day": null,
        "content": "我认为证明我喜欢的从来不是你的漂亮的唯一方式就是永远不打扰，当然如今这更多表明我爱的只是一个概念"
    },
    {
        "year": 2020,
        "month": 12,
        "day": null,
        "content": "时间真快，好像快高考了，但我一点儿也学不进去，我不想上学"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "我不想上学，我坐不下来安静不了，还有个同学偶尔会欺负我，我很痛苦，我非常想念你"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "无声的思念让我痛苦，复杂的孤独令我悲伤，永不打扰是我的底线，不过还好我可以偷偷想你"
    },
    {
        "year": 2021,
        "month": 7,
        "day": null,
        "content": "我去佛山复读了，我感觉自己实在是太糟糕了，为什么我失去了爱情，学业也如此糟糕"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "我去佛山读的那一年，这个月我回肇庆考试的时候看到你也在复读，我想打电话问问，结果是在拨通前那一刻我删除了联系人信息"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "要不要加微信问一句呢？算了还是别，我无法想象那种尴尬的感觉"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "这个复读成绩在我意料之外，我只考了570分，而我的数学居然只有72分，我想正常情况我应该是620分的"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "我只能上一个很普通的学校，这让我感到自己很失败，得知你上了本科我为你感到开心因为你取得了进步"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "看到你似乎有了新男友，你们看上去非常恩爱，我很开心，只是当我第一次知道的时候，会有点吃醋的感觉"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "人们说我想你是因为我找不到新的女朋友，这是有点道理的，但应该不是原因而是状态，况且这是循环论证，逻辑不太成立"
    },
    {
        "year": 2022,
        "month": 12,
        "day": null,
        "content": "你读过《窄门》吗，我想也许我喜欢的从来都只是一个概念而非具体的人"
    },
    {
        "year": 2024,
        "month": null,
        "day": null,
        "content": "祝你早安，午安，晚安，我今年22岁了，没能和你结婚是我一生的遗憾"
    }
    // 如果需要添加更多回忆，请按相同格式在此处添加对象
];
