// memories.js
const memories = [
    {
        year: 2002,
        month: 11,
        day: 14,
        content: "On this day, ZD came into the world."
    },
    {
        year: 2002,
        month: 12,
        day: 7,
        content: "On this day, FLY came into the world."
    },
    {
        "year": 2015,
        "month": 9,
        "day": null,
        "content": "初中开学第一天，我被安排坐在靠近讲台的中间，你在靠近门口窗户的位置；放学以后，视线经过你的座位，我不得不承认，任何为人称道的美丽，都不及第一次遇见你"
    },
    {
        "year": 2015,
        "month": 12,
        "day": null,
        "content": "这段时间我脸上痘痘越来越严重，我内心十分难受和煎熬，我不止一次为此焦虑和难受。我平常从未表现出什么难过，似乎大大咧咧的，其实在你真正做我女朋友之前，我非常的郁闷和煎熬，你可能无法想象这种程度的焦虑"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我一直羞于启齿的是，多年以前，因为脸上的痘痘，我非常郁闷，同学的笑话和自己对社会价值的屈服让我极其痛苦，我在书房尝试自杀未遂。"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "忘了什么时候开始，我们就开始频繁聊天，你的出现让我心情好了很多，我开始慢慢变得真正阳光起来，我感觉每天都过得很开心，从那时起，我开始深深爱上了你。有好几次你问我为什么爱你，我很难给出答案，因为任何答案好像在你的美貌面前都容易沉下去。其实我爱你是因为你将我从痛苦中拯救，或者说，你给予了我第二次新生；今天我似乎已不敢说我永远爱你，但我会永远感激你在我生命中的出现。"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "后来，我发掘好像你也喜欢我，不然为什么在我面前这么害羞，还总陪我玩游戏。但是我还不完全确定，于是我打算观察一段时间再看看"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "我的父母是典型的中国式家长，禁止谈恋爱，禁止玩游戏，严禁我使用智能手机，老人机也不给我使用，我家有一台台式电脑，但电脑在书房而不在我的房间里。但我想和你聊天就像着了迷，为了能和你随时聊天，我让我堂弟给我偷偷弄了一台智能手机，这也为我们在寒假每天都能聊到深夜凌晨两三点创造了先决条件。我记得我们什么都聊，具体我真的忘了。但即使今天我们还在一起，我可能都无法做到和你连续不间断聊到凌晨两三点才入睡。当然我是说假设，因为万一今天我们还在一起，也许还能做到，这只是个假设。"
    },
    {
        "year": 2016,
        "month": null,
        "day": null,
        "content": "经过我十分详细的验证和试探，我确定我们非常相爱。我打算策划一下表白场景，电视剧里都用的套路我不能再用，别人说过的那些话我不能再说，我思考了很久很久，在梦里我无数次梦到向你表白的场景，那时候，我的生活似乎都在围着你转。"
    },
    {
        "year": 2016,
        "month": 12,
        "day": null,
        "content": "12月7号是你生日，生日前的周末我们一起吃了个饭。老实说我非常讨厌去外面吃饭，尤其是人多的地方，况且饭桌上那几个人我完全不认识也对他们没有兴趣，吃饭的时候我脑袋都是空空的，如果不是有你在那里，我压根不会说一句话。"
    },
    {
        "year": 2016,
        "month": 12,
        "day": 24,
        "content": "2016年冬天的平安夜，我们去操场散步，我非常开心，我好像按捺不住想要向你直白表明爱意，但是应该怎么自然引出要表白这个话题呢？边走边说，我都在思考应该怎么引出话题，所以一开始我都是在胡言乱语，比如我问你是否知道原子弹的原理之类的完全没有情趣的话，其实就是在拖延时间。走到一棵紫荆花树下，我终于挤出了一个非常无厘头的表白思路，我当时是这么想的：我必须付出点什么才能得到什么，但不能太为难自己不然做不到的话即使你答应我还是会很尴尬，我打算先问你相不相信我能翻出学校围墙或者爬上这棵树之类的问题，无论你回答相信还是不相信，我都可以比较自然地去过渡到去做某件事的状态。事实上也确实是这样，在你回答以后，我很无厘头地请求，我说翻围墙和爬树不太符合学校规定，然后我迫不及待地说如果围着400m操场跑十圈你就做我女朋友好吗，你就做女朋友好吗。你笑得很灿烂，点点头说嗯，那天傍晚的天空好像都是紫荆花的颜色，我浑身突然充满了力量，真的连续跑十圈，而且过程不带喘气，也没用抽筋也没用什么劳累的感觉；我自己都感觉很神奇。跑完后已过傍晚7:10，我搂着你的肩膀，说不能反悔哦，说完我害怕太晚回家会让我们父母担心，于是在路口分别后，我一路狂飙自行车回到家，连蹦带跳走进客厅准备吃完饭，那天晚上我夸我妈做的饭菜十分美味，她不知道，她儿子刚刚和他心爱之人表白并且成功了。"
    },
    {
        "year": 2016,
        "month": 12,
        "day": 24,
        "content": "回到家洗完澡，我还并没有觉得那是现实，虽然有大量证据表明我们十分相爱，但那时候我依然不敢相信我真的成功！那天晚上我什么都没有思考，脑袋好像放空空的，就像后来吃药以后脑袋迷迷糊糊的感觉，我忘了那天我到底几点才睡着。"
    },
    {
        "year": 2017,
        "month": 4,
        "day": null,
        "content": "我们在一起后，其实我经常被你那几个朋友嘲讽，也被很多人笑话我的痘痘和长相；事实上我也完全认为他们说得对，时常感到难过，但因为有你的存在，我每天还是非常开心，每天都很快乐，只要这世界上有你认为我很好，我就会很幸福。"
    },
    {
        "year": 2018,
        "month": 1,
        "day": null,
        "content": "快要中考了，我每天学得特别痛苦，很多个深夜，我都一边流泪一边写练习册。我从未如此为了一件事情而努力，但我想到这一切都是为了两个人的未来，我觉得非常有动力；我想努力学习在你面前证明我自己，我想告诉你我可以非常优秀，我一直以来都没有什么目标，我向来对任何事情都无所谓，大大咧咧的，但那时候我应该是全校最努力的人之一。"
    },
    {
        "year": 2018,
        "month": null,
        "day": null,
        "content": "有天班主任叫我去办公室，她说你只是一时喜欢我而不会永远喜欢我，我回去思考了一段时间这句话"
    },
    
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "中考成绩出来了，我数学只考了95分，我觉得自己很失败"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "我妈带我去外面旅游，我没有智能手机，每天非常煎熬，在火车上我仔细想了想当时的情况，我无法想象分隔两地的日子，我不知道怎么办，我也不知道怎么说，我总觉得，你一定会在未来某一天离开我。"
    },
    {
        "year": 2018,
        "month": 6,
        "day": null,
        "content": "当我们真的要分开的时候，过度的理性占据了我的大脑。我想到，你这么漂亮，追求者这么多，不可能永远陪着我；你实在是太漂亮了，过去我经常怀疑自己，但你在我身边的时候，我从不会过多焦虑。我一想到我们要分开这么多年，我脑海里只有一个声音，那就是“你一定是眼瞎了犯傻了才会跟着我，你也一定会离开我”，其实，在我一开始就认为这句话是对的，事实上也的确如此，你爱上一个非常糟糕的人。"
    },
    {
        "year": 2018,
        "month": 7,
        "day": null,
        "content": "我在北京，我没智能手机所以我们断联了一个多星期，回到家后，不知道为什么，我发自内心觉得如果我们分开两地，最终的结局一定就是你会离我而去。那时候的我非常懦弱，没有担当，我不敢去爱你，也并没有从你的角度去思考问题，非常自私地选择断联。你可能从未想过我内心对这段感情有多么焦虑，我不敢告诉父母和老师，我也不知道该怎么处理。做出那种选择的我，确实是非常懦弱和失败。"
    },
    {
        "year": 2018,
        "month": 9,
        "day": null,
        "content": "我去到一个离家很远的地方读书，我很痛苦，我想逃避那里的一切人和事"
    },
    {
        "year": 2018,
        "month": 11,
        "day": null,
        "content": "我很难过，我非常仔细想了想自己做出的决定，我认为自己太没有担当了，我应该奋不顾身去守护自己心爱的人，而不是逃避现实，妄自菲薄，于是我决定重新联系你。"
    },
    {
        "year": 2019,
        "month": 1,
        "day": null,
        "content": "太好了，我们又在一起了，这次我一定会坚定维护我们这段感情"
    },
    {
        "year": 2019,
        "month": 1,
        "day": null,
        "content": "寒假我在肇庆补习，我手里没有智能手机，我们用短信保持联系，但我发现我陷入了一种无法自拔的自我怀疑之中，我好像回到了你从未出现到我世界以前的痛苦之中，在给你回复的时候，我大脑总是宕机了一样"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "不明白为什么，虽然你答应和我重新在一起，但我的痛苦似乎没有减轻，我更加怀疑自己，更加自卑和自责"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "我很害怕，我觉得我非常糟糕，我痘痘似乎也越来越多了，我很痛苦"
    },
    {
        "year": 2019,
        "month": 4,
        "day": null,
        "content": "忘记是不是这个月，上周末我去你的学校找你，你害怕被家里人发现，所以我打算下个星期六再去找你。看到你发来一段在公交车上的视频，我明白你的意思，但当我去了一趟洗手间，我发现自己脸上红红的青春痘，我非常痛苦，我打算等下个星期炎症稍微好些以后再去找你，当时我大脑非常难受，于是我随便编了个理由说有点忙，我忘了最开始的时候，我就是用这种话语来逃避的。你提出分手，其实我知道你可能只是随便说说，如果我选择奋不顾身去偏爱一个人，或者告诉你我在为了什么而烦恼，也许你就不会离开我，但我最终还是选择了沉默。到后来我脑子无法思考的时候，在医生的帮助下，我才知道自己到底处于什么境地"
    },
    {
        "year": 2019,
        "month": 2,
        "day": null,
        "content": "我最近很痛苦，即使和你重新在一起我依然有种痛苦感"
    },
    {
        "year": 2019,
        "month": 4,
        "day": null,
        "content": "为什么你会觉得我分手后会打你，这让我很难过，我感到难过也很羞耻，我不知道你为什么会那么认为，我可能真的太糟糕了，不然为什么会让女朋友这样想自己呢。是你将我从漩涡中拯救出来一段时间，让我重新热爱生命热爱生活，我对你，永远都只有无尽的感激。"
    },
    {
        "year": 2020,
        "month": 1,
        "day": null,
        "content": "困在家里我很想联系你，但我还是忍住了，我想着寒假去看医生，结果来了疫情"
    },
    {
        "year": 2020,
        "month": 5,
        "day": null,
        "content": "我去吃了三个月的药，终于有勇气去找你，找完以后我也彻底接受了一个事实，我明白我真地只能偷偷爱着你了。我删除了你的好友，哭了一会儿，咽下眼泪回到座位，试图咽下自己的懦弱和自卑；感情中谁也无法强迫谁，有些东西，一旦失去就真的不在再来，自那以后，我不敢打探任何你的消息，我害怕一靠近，我就忍不住联系你，忍不住想起过去和如今懦弱的自己。"
    },
    {
        "year": 2020,
        "month": 6,
        "day": null,
        "content": "我认为证明我喜欢的从来不是你的漂亮的唯一方式就是永远不打扰，当然如今这更多表明我爱的只是一个概念"
    },
    {
        "year": 2020,
        "month": 12,
        "day": null,
        "content": "时间真快，好像快高考了，但我一点儿也学不进去，我不想上学"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "我不想上学，我坐不下来安静不了，还有个同学偶尔会欺负我，我很痛苦，我非常想念你"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "无声的思念让我痛苦，不过还好我可以偷偷想你"
    },
    {
        "year": 2021,
        "month": 7,
        "day": null,
        "content": "我去佛山复读了，我感觉自己实在是太糟糕了，为什么我失去了爱情，学业也如此糟糕"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "我去佛山读的那一年，这个月我回肇庆考试的时候看到你也在复读，我衷心祝愿我们都能取得进步。"
    },
    {
        "year": 2022,
        "month": 6,
        "day": null,
        "content": "要不要加微信问一句呢？算了，我无法想象那种尴尬的感觉，万一你已经有了新的男朋友，那我就更尴尬了"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "即使复读了一年，我也是只考了570分，我的数学居然只有72分，正常情况我的总分应该是620分的，我非常难过，但我也只能接受这一切。从这天开始，我的人生多了一条遗憾。第一条是没法和你结婚，第二条就是第两次依旧失败的高考。不同的是，这条遗憾我大概率不需要花多长时间就已经完全接受。"
    },
    {
        "year": 2022,
        "month": 7,
        "day": null,
        "content": "从我妈妈那里，我得知了你的录取结果，我为你取得了进步感到开心"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "从2019年以后，再一次看到你，是在桥上的背影。那天晚上我陪我表弟骑车，在桥上我看到一个背影，只是一瞬间的反应，我感觉这个后座上的人好像很熟悉，于是我凑上去看了一眼，的确是你。看到你有了新男友，我感到释怀和难过，我感到释怀是因为，即使是被动相遇，多年以后再见到你时，我依然开心。难过是因为当我那天第一次知道时，会有点吃醋的感觉，好像你上一秒还是在我自行车后座，下一秒就在不断远离我一样，我忘了其实这段路，已经远离了三年多了。那天晚上回到房间，我想起拜伦有一句诗歌“If I should meet thee, after long years，How should I greet thee? With silence and tears”.我们都选择了沉默，当然，如果我奋不顾身追上去，那我也太过无耻和虚伪了，这样一定会被所有人认为，我从来只爱你的青春，和动人的容颜，而事实当然并非如此。"
    },
    {
        "year": 2022,
        "month": 8,
        "day": null,
        "content": "人们说我想你，是因为我找不到新的女朋友，这是有点道理的，但那应该不是原因，更多像是某种状态，如果那作为原因的话，就会陷入循环论证。当然世俗的原因大概率会是对的，如果我自己也打心里认为我爱你完全取决于世俗价值的话。"
    },
    {
        "year": 2022,
        "month": 9,
        "day": 1,
        "content": "在我大学开学的第一天，我的父母没有来送我，我觉得自己很失败，如果我考上了中山大学，我认为他们即便是工作再忙，也愿意来送我一程，但说这些又有什么用呢，我再如何表述我如何难受如何难以阅读，都只会成为失败的借口，就好比。"
    },
    {
        "year": 2022,
        "month": 12,
        "day": null,
        "content": "你读过《窄门》吗，也许我喜欢的从来都只是一个概念而非具体的人"
    },
    {
        "year": 2023,
        "month": 11,
        "day": 14,
        "content": "祝你早安，午安，晚安，明年我就22岁了，没能和你结婚，是我一生的遗憾。"
    },

    // 2024-12-11 add :

    {
        "year": 2020,
        "month": 6,
        "day": null,
        "content": "从前，我没有为了什么东西而拼命努力过，直到遇见你以后，我突然努力学习，是为了在你面前证明自己。失去了你之后，我就像中学一二年级那时候一样，根本没有什么学习的动力。而我也其实是个非常自私的人，我发起请求希望可以和你一起努力学习，我以为这样以后我就可以找到学习的目标，不过结果让我很尴尬。我突然意识到，过去我打算让痘痘好点再去找你的间隔的时间，其实已经冲淡了很多东西，我忽略了这部分变化，我非常难受，但这也许就是懦弱的下场。怯懦自卑，就必定失去所爱之人。于是我删掉了你的微信，大哭一场，我回到教室对着哲学书翻来翻去，我开始寻找一个答案，一个于我而言接近终极的问题的答案，人类活着，究竟应该为了什么，到底应该追求什么"
    },
    {
        "year": 2020,
        "month": 12,
        "day": null,
        "content": "18 岁生日快乐！ 以前我答应过要在你十八岁的生日送你一盒口红，但现在我不知道用什么借口，我又想起上次的尴尬场面，我觉得自己很失败。"
    },
    {
        "year": 2021,
        "month": 1,
        "day": null,
        "content": "我不想学了，我学不进去，我讨厌学习，也许我们还在一个学校就好了，我经常这样想。"
    },
    {
        "year": 2024,
        "month": 2,
        "day": null,
        "content": "我寻求基督教和哲学在一些方面的救赎，我阅读了一点圣经，再读了点西方哲学和物理，我笃信这世界上一定有一个上帝，这个上帝是一切的缔造者，人类无法想象。从维特根斯坦那里，我感到人类精神上的一切痛苦，可能都来自于人类自身语言逻辑的混乱和循环；从杜威那里，我认可有用就是好的这个观点，接受实验主义的观点。"
    },
    {
        "year": 2023,
        "month": 11,
        "day": 14,
        "content": "今天是我21岁生日，我许愿，每天忘记你一点点，最好就是，明年我可以爱上新的人。"
    },
    {
        "year": 2023,
        "month": 12,
        "day": 7,
        "content": "在这个特别的日子，祝你21岁生日快乐！即使生生不见，也要岁岁平安(≧∇≦)/🎂！即使知晓你有新男友，我还是偷偷爱着你。我还是十分自闭，为自己的痘痘和学业感到痛苦和挫败，多年来这一直让我感到极度的抑郁和焦虑。在我的人生中，我对你的出现从来只有感激，我为我的懦弱而抱歉，我想余生阵阵不断的想念，便是对我最大的惩罚。在这里，我爱你。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 13,
        "content": "下午是足球比赛，我在比赛结束前进了一个球，终于看到你开心地笑了出来。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 14,
        "content": "我在日记写到，我要在桃花源盖房子。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 29,
        "content": "我写了一个非常无聊非常没有水平的非常简短的小说，今天拿给你看，你帮我修改了几个错别字，我收到后在文章后面把每个错别字分别抄写了一行。"
    },
    {
        "year": 2017,
        "month": 3,
        "day": 31,
        "content": "最近我们发生了点小矛盾，我已经忘了，但那时候我从不觉得有什么东西是可以将我们分开的。"
    },
    {
        "year": 2017,
        "month": 4,
        "day": 4,
        "content": "我写到，在聊天中说你已经完全是我的人了，我高兴得从椅子上跳了起来。"
    },
    {
        "year": 2017,
        "month": 4,
        "day": 5,
        "content": "似乎小矛盾得到了缓和。"
    },
    {
        "year": 2017,
        "month": 5,
        "day": 24,
        "content": "我写到，第五个月过去了。"
    },
    {
        "year": 2017,
        "month": 6,
        "day": 24,
        "content": "我写到，第六个月过去了。"
    },
    {
        "year": 2017,
        "month": 11,
        "day": 24,
        "content": "我写到，11 个月过去了，还有一个月就是我们恋爱一周年纪念日了，one month, excited? happy? 时间飞快，你我如初。"
    },
    {
        "year": 2018,
        "month": 2,
        "day": 21,
        "content": "我写到，400 多天过去了。"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 16,
        "content": "我写了很长一篇日记，结尾是‘我希望有一天，我们光明正大地，快乐地品味如茶一般的人生……’"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 17,
        "content": "我写了个中考最差目标，最后差了很多分。"
    },
    {
        "year": 2018,
        "month": 6,
        "day": 18,
        "content": "空"
    },
    {
        "year": 2020,
        "month": 12,
        "day": 24,
        "content": "我写了一首古体诗。"
    },
    {
        "year": 2020,
        "month": 12,
        "day": 24,
        "content": "新年将至，我在贴纸栏许愿未来，我想未来有一天，你能回到我身边，如果回不来，那就祝你早安，午安，晚安。不管你相不相信，我的确从未爱过其他人，我想我们的确不合适，但我会偷偷继续爱着你。"
    }

    ,
    {
        "year": 2021,
        "month": 12,
        "day": 07,
        "content": "生日快乐！不知道你高考去了哪里，反正我非常糟糕，祝你拥有幸福与美好的四年！"
    },
    {
        "year": 2023,
        "month": 2,
        "day": null,
        "content": "我倾诉了我的烦恼，他们说我在自我感动，我非常无语，这不是废话吗，谁看不出来这是自我感动。但是我明明请教的是我应该怎么做，他们回复的都是“是什么”。我明白了一个道理，客体都喜欢对别人下定义和判断，而主体本身都喜欢回答自己为什么。"
    }
    // 如果需要添加更多回忆，请按相同格式在此处添加对象
];
